Repository: MaxShytov/elli-friends-app
Catalog: lib/l10n/app_*.arb
Languages: am, my

source: Settings
am: ቅንብሮች
my: ဆက်တင်များ

source: Learn Numbers
am: ቁጥሮችን ተማር
my: ဂဏန်းများကို လေ့လာပါ

# learnSubtraction
source: Subtraction
am: መቀነስ
my: နုတ်ခြင်း

source: Learn Letters
am: ፊደሎችን ተማር
my: အက္ခရာများကို လေ့လာပါ

source: Learn Shapes
am: ቅርጾችን ተማር
my: ပုံသဏ္ဍာန်များကို လေ့လာပါ

source: Learn Colors
am: ቀለሞችን ተማር
my: အရောင်များကို လေ့လာပါ

source: Hello!
am: ሰላም!
my: မင်္ဂလာပါ!

source: Tap me!
am: ንካኝ!
my: ငါ့ကို နှိပ်ပါ!

source: Language Settings
am: የቋንቋ ቅንብሮች
my: ဘာသာစကား ဆက်တင်များ

# selectLanguage
source: Select your language
am: ቋንቋህን ምረጥ
my: သင့်ဘာသာစကားကို ရွေးချယ်ပါ

# languageChanged
source: Language changed to {language}
am: ቋንቋ ወደ {language} ተቀይሯል
my: {language} သို့ ဘာသာစကား ပြောင်းလဲပြီးပါပြီ

source: 🦋 Lesson: Counting (Demo)
am: 🦋 ትምህርት: መቁጠር (ማሳያ)
my: 🦋 သင်ခန်းစာ: ရေတွက်ခြင်း (သရုပ်ပြ)

source: Loading lesson...
am: ትምህርት በመጫን ላይ...
my: သင်ခန်းစာ တင်နေသည်...

# lessonLoadError
source: Error loading lesson
am: ትምህርቱን በመጫን ላይ ስህተት
my: သင်ခန်းစာ တင်ရာတွင် အမှား

source: Try Again
am: እንደገና ሞክር
my: ထပ်ကြိုးစားပါ

source: Skip
am: ዝለል
my: ကျော်သွားပါ

source: No data
am: መረጃ የለም
my: အချက်အလက် မရှိပါ

# lessonScenes
source: Lesson Scenes ({count})
am: የትምህርት ትዕይንቶች ({count})
my: သင်ခန်းစာ မြင်ကွင်းများ ({count})

source: Character
am: ገጸ ባህርይ
my: ဇာတ်ကောင်

source: ⏸️ Pause
am: ⏸️ ቆም
my: ⏸️ ခေတ္တရပ်ရန်

source: Scene
am: ትዕይንት
my: မြင်ကွင်း

source: Start Lesson
am: ትምህርት ጀምር
my: သင်ခန်းစာ စတင်ရန်

# comingSoon
source: Coming soon: Interactive lesson playback! 🎉
am: በቅርቡ: መስተጋብራዊ ትምህርት! 🎉
my: မကြာမီ: အပြန်အလှန် သင်ခန်းစာ ဖွင့်ခြင်း! 🎉

source: Topic
am: ርዕስ
my: အကြောင်းအရာ

source: Level
am: ደረጃ
my: အဆင့်

source: Lesson
am: ትምህርት
my: သင်ခန်းစာ

source: Next
am: ቀጣይ
my: နောက်တစ်ခု

source: Back
am: ተመለስ
my: နောက်သို့

source: Correct!
am: ትክክል!
my: မှန်ကန်သည်!

source: Excellent!
am: እጅግ በጣም ጥሩ!
my: အလွန်ကောင်းမွန်သည်!

# youEarnedStars
source: You earned {stars} stars!
am: {stars} ኮከቦች አግኝተሃል!
my: သင် {stars} ကြယ်များ ရရှိခဲ့သည်!

source: out of
am: ከ
my: မှ

source: Done
am: ተጠናቀቀ
my: ပြီးပါပြီ

# again
source: Try Again
am: እንደገና ሞክር
my: ထပ်ကြိုးစားပါ

# elliGreeting
source: Hi! I'm Elli the Elephant!
am: ሰላም! እኔ ኤሊ ዝሆን ነኝ!
my: မင်္ဂလာပါ! ငါ အယ်လီ ဆင်ကြီးပါ!

# letsTogether
source: Let's learn together!
am: አብረን እንማር!
my: အတူတူ လေ့လာကြရအောင်!

# chooseActivity
source: Choose an activity!
am: እንቅስቃሴ ምረጥ!
my: လှုပ်ရှားမှု တစ်ခု ရွေးပါ!

# happyToSee
source: I'm so happy to see you!
am: ስላየሁህ በጣም ደስ ብሎኛል!
my: မင်းကို တွေ့ရတာ အရမ်း ဝမ်းသာပါတယ်!

source: Test Voice
am: ድምጽ ሞክር
my: အသံ စမ်းသပ်ပါ

source: Start
am: ጀምር
my: စတင်ပါ

# difficultyEasy
source: Easy
am: ቀላል
my: လွယ်ကူ

# difficultyMedium
source: Medium
am: መካከለኛ
my: အလယ်အလတ်

# difficultyHard
source: Hard
am: ከባድ
my: ခက်ခဲ

# difficultyLevel
source: Level {level}
am: ደረጃ {level}
my: အဆင့် {level}

# orsonGreeting
source: Hi, I'm Orson the purple cat
am: ሰላም፣ እኔ ኦርሰን ወይን ጥቁር ድመት ነኝ
my: မင်္ဂလာပါ၊ ကျွန်တော် ခရမ်းရောင် ကြောင် Orson ပါ

# mervGreeting
source: Hi, I'm Merv the yellow puppy
am: ሰላም፣ እኔ ሜርቭ ቢጫ ቡችላ ነኝ
my: မင်္ဂလာပါ၊ ကျွန်တော် အဝါရောင် ခွေး Merv ပါ

source: Developer Settings
am: የገንቢ ቅንብሮች

source: Reset Lesson Data
am: የትምህርት መረጃ ዳግም አስጀምር

# resetLessonDataConfirm
source: Reset all lesson data to defaults?
am: ሁሉንም የትምህርት መረጃ ወደ ነባሪ ዳግም ያስጀምር?

# resetSuccess
source: Data reset successfully
am: መረጃ በተሳካ ሁኔታ ዳግም ተጀምሯል

source: Cancel
am: ሰርዝ

source: Reset
am: ዳግም አስጀምር
